components/widgets/DocumentsWidget.php

    public function init()
    {
        $this->documents = Document::getByRef($this->ref);

        if ($this->keyType == Document::KEY_TYPE_SALE) {
            $listing = Sale::findOne(['ref' => $this->ref]);
---
SELECT * FROM `sale` WHERE `ref` IS NULL