modules/deals/models/Deals.php

SELECT * FROM `deals` WHERE (`company_id`=6) AND (`created_by`=19) AND (`is_international`=0)
---
    public function getFirstRecordModel(?string $id = null): ?iterable
    {
        $companyId = Company::getCompanyIdBySubdomain();

        if ($companyId == 'main' or $companyId == '') {
            if (!$id) {
                $checkRecord = self::find()->where(['is_international' => 0])->one();
                empty($checkRecord) ? $firstRecord = $this : $firstRecord = $checkRecord;
            } else {
                $firstRecord = self::find()->where([
                    'id'         => $id
                ])->one();
            }
        } else {
            $viewsByGroup = (new OwnerManageGroup())->getViewsByGroup();
            if ($viewsByGroup) {
                if (Yii::$app->controller->action->id === 'index') {
                    $checkRecord = self::find()->where([
                        'company_id'       => $companyId,
                        'created_by'       => $viewsByGroup,
                        'is_international' => 0
                    ])->one();