modules/calendar/views/main/_event.php

if ($companyId == '')
    $companyUsers = User::find()->all();
else
    $companyUsers = User::find()->where(['company_id' => $companyId])->all();
---
SELECT * FROM `user` WHERE `company_id`=6

        </div>
    </div>
<?php
$types = ArrayHelper::map(EventType::find()->all(), 'id', 'name');
---
SELECT * FROM `event_type`