models/owner/Owner.php

SELECT `id`, `first_name`, `last_name` FROM `contacts` WHERE `company_id`=6
---
    public function getOwnerCompany() : ?array
    {
        $companyId = Company::getCompanyIdBySubdomain();
        $res       = [];

        if ($companyId == 'main' ) {
            $modelContact = Contacts::find()->select([
                'id',
                'first_name',
                'last_name'
            ])->asArray()->all();
        } else {
            $modelContact = Contacts::find()->select([
                'id',
                'first_name',
                'last_name'
            ])->where([
                'company_id' => $companyId
            ])->asArray()->all();