models/statusHistory/ArchiveHistory.php

SELECT * FROM `status_history` WHERE (`name_model`='sale') AND (`parent_id` IS NULL)
---
    protected function getModelStatusHistory(): ?iterable
    {
        $model = $this->anyModel;

        if (!$model) {
            throw new \yii\base\Exception('This page doesn\'t exist!');
        }

        $modelHistory = StatusHistory::find()->where([
            'name_model' => $model->tableName(),
            'parent_id'  => $model->id
        ])->all();