controllers/SiteController.php

    public function actionIndex()
    {
        $companyIdBySubdomain = Company::getCompanyIdBySubdomain();
        $salesByMonth = Sale::getSalesByMonth();
        $rentalsByMonth = Rentals::getRentalsByMonth();
        $sales['sale'] = ArrayHelper::map($salesByMonth, 'month', 'countByMonth');
        $rentals['rental'] = ArrayHelper::map($rentalsByMonth, 'month', 'countByMonth');
        $jsonSalesRentalsByMonth = json_encode(array_merge($sales, $rentals));

        $leadersSaleQuery = UserModel::find()
            ->select(['user.username AS username', 'COUNT(*) AS countDeals'])
            ->leftJoin('sale', 'user.id = sale.user_id')
            ->where(['sale.company_id' => $companyIdBySubdomain])
            ->andWhere(['user.company_id' => $companyIdBySubdomain])
            ->groupBy(['user.id'])
            ->orderBy(['countDeals' => SORT_DESC])
            ->limit(10);
        $leadersRentalsQuery = UserModel::find()
            ->select(['user.username AS username', 'COUNT(*) AS countDeals'])
            ->leftJoin('rentals', 'user.id = rentals.user_id')
            ->where(['rentals.company_id' => $companyIdBySubdomain])
            ->andWhere(['user.company_id' => $companyIdBySubdomain])
            ->groupBy(['user.id'])
            ->orderBy(['countDeals' => SORT_DESC])
            ->limit(10);

        $leaders = $leadersSaleQuery->union($leadersRentalsQuery)->all();
        $leaders = array_slice(ArrayHelper::map($leaders, 'username', 'countDeals'), 0, 10);

        $reminderQuery = Reminder::find()
            ->where(['user_id' => Yii::$app->user->id])
            ->orderBy(['remind_at_time'=> SORT_DESC, 'created_at'=> SORT_DESC]);
---
SELECT * FROM `reminder` WHERE `user_id`=19 ORDER BY `remind_at_time` DESC, `created_at` DESC LIMIT 6