modules/notifications/controllers/NotificationsController.php

SELECT * FROM `notification` WHERE (`user_id` IS NULL) AND ((seen=false) OR (flashed=false)) ORDER BY `created_at` DESC
SELECT * FROM `reminder` WHERE (`user_id` IS NULL) AND (`status`=1)
---
    public function actionPoll($seen = 0)
    {
        $seen = $seen ? 'true' : 'false';

        /** @var Notification $class */
        $class = $this->notificationClass;
        $models = $class::find()
            ->where(['user_id' => $this->user_id])
            ->andWhere(['or', "seen=$seen", 'flashed=false'])
            ->orderBy('created_at DESC')
            ->all();

        $reminders = Reminder::findAll(['user_id' => Yii::$app->user->id, 'status' => Reminder::STATUS_ACTIVE]);