components/NotificationReminder.php

SELECT * FROM `user` WHERE `id`=19
SELECT * FROM `leads` WHERE (`created_by_user_id`=19) AND (`is_parsed`=0)
SELECT * FROM `reminder` WHERE (`user_id`=19) AND (`status`=1)
---
    public function init()
    {
        if (!Yii::$app->user->isGuest) {
            $user = User::findOne(Yii::$app->user->id);
            $groups = ManageGroupChild::getForUser($user->id);
            $currentTime = time();
            $this->checkTaskDeadline($user);
            if (Yii::$app->request->isAjax) {
//                if ($user->imap_enabled)
//                    EmailImportLeadParser::checkEmail($user);

                $leads = Leads::find()->where(['created_by_user_id' => Yii::$app->user->id])
                    ->with('contactNote')
                    ->andWhere(['is_parsed' => Leads::IS_PARSED_NOT])
                    ->all();
                foreach ($leads as $lead) {
                    if (!$lead->contactNote)
                        $this->createLeadContactReminder($lead);
//                    else
//                        $this->removeLeadContactReminder($lead);
                }
                $reminders = Reminder::findAll(['user_id' => $user->id, 'status' => Reminder::STATUS_ACTIVE]);

SELECT `task_id` FROM `task_responsible_user` WHERE `user_id`=19
---
    private function checkTaskDeadline($user)
    {
        $tasksIdsArr = TaskResponsibleUser::find()->where(['user_id'=>$user->id])->select(['task_id'])->column();