modules/lead/models/LeadType.php

    public static function getTypes()
    {
        return self::find()->all();
---
SELECT * FROM `lead_type`