modules/lead/models/LeadSubStatus.php

SELECT * FROM `lead_sub_status`
---
    public static function getSubStatuses()
    {
        return self::find()->all();