modules/sales/controllers/SaleController.php

SELECT * FROM `user` WHERE `id` IS NULL
---
            'featuresItems'           => ArrayHelper::map($featuresItems, 'id', 'features'),
            'disabledAttribute'       => true,
            'existRecord'             => (new ExistRecordModel())->getExistRecordModel('app\models\Sale'),
            'assignedToUser'          => User::findOne($firstRecord->agent_id),

SELECT * FROM `contacts` WHERE `id` IS NULL
---
            'usersDataProvider'       => $usersDataProvider,
            'contactsSearchModel'     => $contactsSearchModel,
            'contactsDataProvider'    => $contactsDataProvider,
            'ownerRecord'             => Contacts::findOne($firstRecord->landlord_id),