models/DocumentsGenerated.php

SELECT * FROM `documents_generated`
---
    public static function getAll()
    {
        return self::find()->all();