models/GridColumns.php

    public static function getForSection($type, $userId)
    {
        return GridColumns::findAll([
            'type'    => $type,
            'user_id' => $userId
        ]);
---
SELECT * FROM `grid_columns` WHERE (`type`=1) AND (`user_id`=19)