models/Locations.php

SELECT * FROM `locations` WHERE type=2
---
    public static function getByType($type)
    {
        return Locations::find()->where(['type' => $type])->with('children')->all();

SELECT * FROM `locations`
---
    public static function getAll()
    {
        return Locations::find()->all();